names = ["Java", "C/C++", "PHP", "Python", "C#", ".NET", "Golang", "Node.js", "Hadoop", "语音/视频/图形开发", "数据采集", "GIS工程师",
         "全栈工程师", "其他后端开发",
         "前端开发工程师", "Android", "iOS", "U3D", "UE4", "Cocos", "技术美术", "JavaScript",
         "测试工程师", "软件测试", "自动化测试", "功能测试", "测试开发", "硬件测试", "游戏测试", "性能测试", "渗透测试", "移动端测试",
         "运维工程师", "IT技术支持", "网络工程师", "网络安全", "系统工程师", "运维开发工程师", "系统管理员", "DBA", "系统安全", "技术文档工程师",
         "图像算法", "自然语言处理算法", "大模型算法", "数据挖掘", "规控算法", "SLAM算法", "推荐算法", "搜索算法", "语音算法", "风控算法", "算法研究员", "算法工程师",
         "机器学习", "深度学习", "自动驾驶系统工程师", "数据标注/AI训练师",
         "售前技术支持", "售后技术支持", "销售技术支持", "客户成功",
         "数据分析师", "数据开发", "数据仓库", "ETL工程师", "数据挖掘", "数据架构师",
         "项目经理/主管", "项目助理", "项目专员", "实施工程师", "实施顾问", "需求分析工程师", "硬件项目经理",
         "技术经理", "架构师", "技术总监", "CTO", "测试经理", "技术合伙人", "运维总监",
         "其他技术职位",
         "web前端",
         "项目经理/主管", "项目助理", "项目专员", "实施工程师", "实施顾问", "需求分析工程师", "电气工程师", "电子工程师", "电气设计工程师", "集成电路IC设计", "IC验证工程师",
         "版图设计工程师", "FAE", "硬件工程师", "嵌入式", "自动化", "FPGA开发", "单片机", "驱动开发", "PCB工艺", "射频工程师", "电路设计", "系统集成", "光学工程师",
         "DSP开发", "通信项目专员", "通信项目经理", "通信技术工程师", "通信研发工程师", "无线/射频通信工程师", "移动通信工程师", "电信网络工程师", "数据通信工程师", "通信测试工程师",
         "光通信工程师", "光传输工程师", "光网络工程师", "通信电源工程师", "有线传输工程师", "通信设备工程师", "核心网工程师", "通信标准化工程师",
         "产品经理 ", "产品专员 ", "产品助理 ", "电商产品经理 ", "数据产品经理 ", "移动产品经理 ", "AI产品经理",
         "游戏策划 ", "系统策划 ", "游戏数值策划 ", "游戏制作人",
         "用户研究员 ", "用户研究经理 ", "用户研究总监",
         "高级产品管理岗"
         "金融产品经理 ", "硬件产品经理 ", "亚马逊产品开发 ", "化妆品产品经理 ", "其他产品职位",
         "销售专员 ", "电话销售 ", "网络销售 ", "渠道销售 ", "大客户代表 ", "客户经理 ", "BD经理 ", "客户代表 ", "销售工程师",
         "销售经理 ", "销售总监 ", "销售VP ", "团队经理 ", "城市经理 ", "区域总监",
         "销售助理 ", "销售运营 ", "商务专员 ", "商务经理 ", "商务总监 ",
         "外贸业务员 ", "外贸经理",
         "课程顾问 ", "招生顾问 ", "留学顾问",
         "汽车销售 ", "汽车配件销售 ", "二手车评估师",
         "置业顾问 ", "地产中介 ", "物业招商管理 ", "房地产销售总监",
         "服装导购 ", "珠宝销售 ", "美容顾问 ", "化妆品导购 ", "会籍顾问 ", "瘦身顾问 ", "旅游顾问",
         "医药代表 ", "医疗器械销售 ", "药店店员 ", "药店店长 ", "医美咨询 ", "健康顾问 ", "口腔咨询师",
         "广告销售 ", "会展活动销售 ", "会议活动销售",
         "理财顾问 ", "保险顾问 ", "信用卡销售 ", "证券经纪人",
         "其他销售职位",
         "行政专员/助理 ", "行政经理/主管 ", "行政总监 ", "前台 ", "后勤 ", "经理助理 ", "文员 ", "企业党建",
         "人力资源专员/助理 ", "人力资源经理/主管 ", "人力资源总监 ", "招聘 ", "HRBP ", "培训 ", "员工关系 ", "组织发展 ", "企业文化 ", "薪酬绩效",
         "法务专员/助理 ", "法务经理/主管 ", "法务总监 ", "法律顾问 ", "律师",
         "其他职能职位",
         "会计 ", "总账会计 ", "成本会计 ", "结算会计 ", "税务外勤会计 ", "建筑/工程会计",
         "审计 ", "税务",
         "财务经理/主管 ", "财务总监/VP ", "CFO",
         "出纳 ", "风控 ", "财务顾问 ", "统计员 ", "财务分析/财务BP",
         "普工/操作工 ", "包装工 ", "学徒工 ", "搬运工/装卸工 ", "组装工",
         "电工 ", "木工 ", "焊工 ", "氩弧焊工 ", "钳工 ", "车工 ", "磨工 ", "铣工 ", "钻工 ", "铆工 ", "模具工 ", "切割工 ", "折弯工 ", "注塑工 ", "钣金工 ",
         "抛光工 ", "喷塑工 ", "电镀工 ", "机修工 ", "空调工 ", "电梯工 ", "油漆工 ", "锅炉工 ", "弱电工 ", "水电工",
         "叉车工 ", "铲车司机 ", "挖掘机司机",
         "质量管理/测试 ", "质检员 ", "实验室技术员 ", "体系工程师 ", "体系审核员 ", "产品认证工程师 ", "失效分析工程师 ", "可靠度工程师 ", "供应商质量工程师 ",
         "医疗器械生产/质量管理 ", "汽车质量工程师 ", "计量工程师",
         "CNC/数控 ", "机械工程师 ", "机械结构工程师 ", "工艺工程师 ", "机械设备工程师 ", "模具工程师 ", "机械制图员 ", "机电工程师 ", "注塑工程师 ", "夹具工程师 ",
         "冲压工程师 ", "铸造/锻造工程师 ", "机械维修/保养 ", "材料工程师 ", "工业工程师(IE) ", "焊接工程师 ", "热设计工程师 ", "液压工程师",
         "车间主任 ", "生产组长/拉长 ", "生产总监 ", "厂长 ", "生产文员 ", "生产计划/物料管理(PMC) ", "生产设备管理员 ", "厂务",
         "生产安全员 ", "施工安全员 ", "EHS工程师 ", "安全评价师",
         "实验室技术员 ", "化工工程师 ", "食品/饮料研发 ", "化妆品研发 ", "化妆品产品经理 ", "涂料研发 ", "化工项目经理",
         "服装/纺织/皮革跟单 ", "打样/制版 ", "服装/纺织设计 ", "面料辅料开发 ", "缝纫工 ", "样衣工 ", "量体师 ", "裁剪工",
         "电池工程师 ", "电机工程师",
         "车身/造型设计 ", "汽车电子工程师 ", "自动驾驶系统工程师 ", "线束设计 ", "内外饰设计工程师 ", "动力系统工程师 ", "底盘工程师 ", "汽车零部件设计 ", "汽车设计 ",
         "汽车质量工程师 ", "总装工程师 ", "汽车项目管理",
         "EHS工程师 ", "环境检测员 ", "环评工程师 ", "环保工程师 ", "碳排放管理师",
         "其他生产制造职位", ]


def find_duplicates(lst):
    # 使用set去重
    unique_items = set(lst)

    # 初始化一个空列表用于存放重复的元素
    duplicates = []

    # 遍历原始列表，找出重复的元素
    for item in lst:
        if lst.count(item) > 1 and item not in duplicates:
            duplicates.append(item)

    return list(unique_items), duplicates


# 对列表进行去重并找出重复元素
unique_items, duplicate_items = find_duplicates(names)

# 输出结果
print("去重前的列表个数:", len(names))
print("去重后的列表:", unique_items)
print("去重后的列表个数:", len(unique_items))
print("重复的元素:", duplicate_items)
print("一共少了:", len(names) - len(unique_items))

a = ["版图设计工程师", "FAE", "硬件工程师", "嵌入式", "自动化", "FPGA开发", "单片机", "驱动开发", "PCB工艺", "射频工程师", "电路设计", "系统集成", "光学工程师",
     "DSP开发", "通信项目专员", "通信项目经理", "通信技术工程师", "通信研发工程师", "无线/射频通信工程师", "移动通信工程师", "电信网络工程师", "数据通信工程师", "通信测试工程师",
     "光通信工程师", "光传输工程师", "光网络工程师", "通信电源工程师", "有线传输工程师", "通信设备工程师", "核心网工程师", "通信标准化工程师",
     # 上面的正在爬
     # 下面的还没开始爬
     "产品经理", "产品专员", "产品助理", "电商产品经理", "数据产品经理", "移动产品经理", "AI产品经理",
     "游戏策划", "系统策划", "游戏数值策划", "游戏制作人",
     "用户研究员", "用户研究经理", "用户研究总监",
     "高级产品管理岗",
     "金融产品经理", "硬件产品经理", "亚马逊产品开发", "化妆品产品经理", "其他产品职位",
     "销售专员", "电话销售", "网络销售", "渠道销售", "大客户代表", "客户经理", "BD经理", "客户代表", "销售工程师",
     "销售经理", "销售总监", "销售VP", "团队经理", "城市经理", "区域总监",
     "销售助理", "销售运营", "商务专员", "商务经理", "商务总监",
     "外贸业务员", "外贸经理",
     "课程顾问", "招生顾问", "留学顾问",
     "汽车销售", "汽车配件销售", "二手车评估师",
     "置业顾问", "地产中介", "物业招商管理", "房地产销售总监",
     "服装导购", "珠宝销售", "美容顾问", "化妆品导购", "会籍顾问", "瘦身顾问", "旅游顾问",
     "医药代表", "医疗器械销售", "药店店员", "药店店长", "医美咨询", "健康顾问", "口腔咨询师",
     "广告销售", "会展活动销售", "会议活动销售",
     "理财顾问", "保险顾问", "信用卡销售", "证券经纪人",
     "其他销售职位",
     "行政专员/助理", "行政经理/主管", "行政总监", "前台", "后勤", "经理助理", "文员", "企业党建",
     "人力资源专员/助理", "人力资源经理/主管", "人力资源总监", "招聘", "HRBP", "培训", "员工关系", "组织发展", "企业文化", "薪酬绩效",
     "法务专员/助理", "法务经理/主管", "法务总监", "法律顾问", "律师",
     "其他职能职位",
     "会计", "总账会计", "成本会计", "结算会计", "税务外勤会计", "建筑/工程会计",
     "审计", "税务",
     "财务经理/主管", "财务总监/VP", "CFO",
     "出纳", "风控", "财务顾问", "统计员", "财务分析/财务BP",
     "普工/操作工", "包装工", "学徒工", "搬运工/装卸工", "组装工",
     "电工", "木工", "焊工", "氩弧焊工", "钳工", "车工", "磨工", "铣工", "钻工", "铆工", "模具工", "切割工", "折弯工", "注塑工", "钣金工", "抛光工", "喷塑工",
     "电镀工", "机修工", "空调工", "电梯工", "油漆工", "锅炉工", "弱电工", "水电工",
     "叉车工", "铲车司机", "挖掘机司机",
     "质量管理/测试", "质检员", "实验室技术员", "体系工程师", "体系审核员", "产品认证工程师", "失效分析工程师", "可靠度工程师", "供应商质量工程师", "医疗器械生产/质量管理", "汽车质量工程师",
     "计量工程师",
     "CNC/数控", "机械工程师", "机械结构工程师", "工艺工程师", "机械设备工程师", "模具工程师", "机械制图员", "机电工程师", "注塑工程师", "夹具工程师", "冲压工程师", "铸造/锻造工程师",
     "机械维修/保养", "材料工程师", "工业工程师(IE)", "焊接工程师", "热设计工程师", "液压工程师",
     "车间主任", "生产组长/拉长", "生产总监", "厂长", "生产文员", "生产计划/物料管理(PMC)", "生产设备管理员", "厂务",
     "生产安全员", "施工安全员", "EHS工程师", "安全评价师",
     "化工工程师", "食品/饮料研发", "化妆品研发", "涂料研发", "化工项目经理",
     "服装/纺织/皮革跟单", "打样/制版", "服装/纺织设计", "面料辅料开发", "缝纫工", "样衣工", "量体师", "裁剪工",
     "电池工程师", "电机工程师",
     "车身/造型设计", "汽车电子工程师", "自动驾驶系统工程师", "线束设计", "内外饰设计工程师", "动力系统工程师", "底盘工程师", "汽车零部件设计", "汽车设计", "总装工程师", "汽车项目管理",
     "环境检测员", "环评工程师", "环保工程师", "碳排放管理师",
     "其他生产制造职位", ]
print('a=', len(a)/5)
